const router = new require('koa-router')();
const sso = require('../lib/sso');

const question = [
  { key: 'q1', rows: 5, label: 'ทำไมถึงอยากมาค่ายจุฬาฯ ฮักน่าน คิดว่าแตกต่างจากค่ายอื่นอย่างไร' },
  {
    key: 'q2',
    rows: 5,
    label:
      'อธิบายว่าคุณเป็นคนแบบไหนเวลาอยู่ในกลุ่ม ทั้งเวลาอยู่กับเพื่อน และการทำงาน พร้อมบอกเหตุผลให้เรารู้จักคุณมากที่สุด'
  },
  {
    key: 'q3',
    rows: 5,
    label:
      'ถ้ามีการให้เลือกผู้นำ แล้วมีคนหนึ่งเสนอตัวเองขึ้นมา แต่คุณเห็นว่าคนนี้ไม่มีความสามารถมากพอที่จะเป็นผู้นำได้ คุณจะทำอย่างไร'
  },
  {
    key: 'q4',
    rows: 7,
    label:
      'ภูเขาหัวโล้นเป็นปัญหาที่พบได้ทั่วไปในจังหวัดน่าน ซึ่งภูเขาหัวโล้นมีผลมาจากการทำการเกษตรของชาวบ้าน โดยได้รับการสนับสนุนจากนายทุน และนายทุนได้รับพื้นที่สัมปทานจากรัฐบาล คุณมีความคิดเห็นอย่างไรกับเรื่องนี้'
  },
  { key: 'q5', rows: 1, label: 'อยากบอกอะไรกับฮักน่าน 😃' }
];
// '⛰🙋 🖍🤔';
module.exports = router.prefix('/quiz').get('/', ctx => ctx.ok(question));
